Stellaris-code/stm32h747i-xash3d/BSP/CM7/Src/main.c
/**
  ******************************************************************************
  * @file    BSP/CM7/Src/main.c
  * @author  MCD Application Team
  * @brief   This example code shows how to use the STM32H747I-DISCO BSP Drivers
  *          This is the main program for Cortex-M7.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm_main.h"

#include "stm32h747i_discovery_sd.h"

//#include "doomgeneric/doomgeneric.h"

#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "usbd_cdc_if.h"

/** @addtogroup STM32H7xx_HAL_Examples
  * @{
  */

/** @addtogroup BSP
  * @{
  */

uint8_t SetSysClock_PLL_HSI_480(void);

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint8_t DemoIndex = 0;
__IO uint8_t NbLoop = 1;

#ifndef USE_FULL_ASSERT
uint32_t    ErrorCounter = 0;
#endif

/* Wave Player Pause/Resume Status. Defined as external in waveplayer.c file */
__IO uint32_t PauseResumeStatus = IDLE_STATUS;

/* Counter for Sel Joystick pressed*/
__IO uint32_t PressCount = 0;
__IO uint32_t ButtonState=0;
uint8_t toggle_led = 0;
__IO uint32_t CameraTest=0;
/* Volume of the audio playback */
/* Initial volume level (from 0% (Mute) to 100% (Max)) */
__IO uint8_t volume = 60;
__IO uint8_t VolumeChange = 0;
__IO uint32_t SRAMTest = 0;
__IO uint32_t SdramTest=0;
/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);
static void Display_DemoDescription(void);
static void MPU_Config(void);
static void CPU_CACHE_Enable(void);
static void HL_demo(void);

extern UART_HandleTypeDef hcom_uart[];

extern void RetargetInit(UART_HandleTypeDef *huart);
extern int start_hl( int argc, char **argv );

BSP_DemoTypedef  BSP_examples[]=
{
  //{Joystick_demo, "JOYSTICK EXTI", 0},
  //{Touchscreen_demo1, "TOUCHSCREEN DEMO1", 0},
  //{Touchscreen_demo2, "TOUCHSCREEN DEMO2", 0},
  //{LCD_demo, "LCD", 0},
  //{Camera_demo, "CAMERA", 0},
  //{AudioPlay_demo, "AUDIO PLAY", 0},
  //{AudioRecord_demo, "AUDIO RECORD", 0},
  //{SD_DMA_demo, "SD", 0},
  //{SD_IT_demo, "SD", 0},
  //{SD_POLLING_demo, "SD", 0},
  //{QSPI_demo, "QSPI", 0},
  //{SDRAM_demo, "SDRAM", 0},
  //{SDRAM_DMA_demo, "SDRAM MDMA", 0},
  {HL_demo, "Half-Life", 0}
};
/* Private functions ---------------------------------------------------------*/

TIM_HandleTypeDef timmy = {0};

/**
  * @brief  Initialize the hardware timer 4.
  * @param  None
  * @retval None
  */
void HardwareTimer4_Init(void)
{
	__TIM2_CLK_ENABLE();	/* Enable TIM4 interface clock */

	/* Desired_timer_frequency = Timer_input_frequency / (prescaler * period)
		 Timer_input_frequency = 84 MHz (same as TIM3, TIM4 is also on APB1)
		 Desired_timer_frequency = 10 Hz (Rotate the LEDs at that frequency for the visuals)
		 ---> prescaler * period = 84 MHz / 100 Hz = 10500000 = 840 * 1000 */

	timmy.Instance = TIM2;																/* Use TIM4 */
	timmy.Init.Prescaler = 1;													/* Set prescaler to 2100 */
	timmy.Init.CounterMode = TIM_COUNTERMODE_DOWN;				/* Count down */
	timmy.Init.Period = 100*1000*1; // 1ms
	timmy.Init.ClockDivision = TIM_CLOCKDIVISION_DIV4;		/* Set clock division to 1 */
	timmy.Init.RepetitionCounter = 0;
	timmy.Channel = HAL_TIM_ACTIVE_CHANNEL_CLEARED;			/* Not using channels */

	/* Initialize the TIM Time Base Unit */
	HAL_TIM_Base_Init(&timmy);

	/* Start TIM3 in interrupt mode */
	HAL_TIM_Base_Start_IT(&timmy);

	/* Set priority for TIM3 IRQ */
	HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);

	/* Enable IRQ for the TIM3 Timer*/
	//HAL_NVIC_EnableIRQ(TIM2_IRQn);
	// Enable the interrupt in the sound init code
}

extern void OPL_STM_TimerCallback(void);

void TIM2_IRQHandler(void)
{
	unsigned ticks_before = HAL_GetTick();

	BSP_LED_Toggle(LED1);
	//AUDIO_Process();
	//OPL_STM_TimerCallback();

	unsigned ticks_after = HAL_GetTick();
	unsigned diff = ticks_after - ticks_before;

	HAL_TIM_IRQHandler(&timmy);
}

static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();

  /*Configure GPIO pin : CEC_CK_MCO1_Pin */
  GPIO_InitStruct.Pin = CEC_CK_MCO1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
  HAL_GPIO_Init(CEC_CK_MCO1_GPIO_Port, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}


extern void qembd_vidinit();

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */

extern uint8_t _sextram, _eextram;
void early_init()
{
	  /* System Init, System clock, voltage scaling and L1-Cache configuration are done by CPU1 (Cortex-M7)
	     in the meantime Domain D2 is put in STOP mode(Cortex-M4 in deep-sleep)
	  */

	  /* Configure the MPU attwributes as Write Through */
	  MPU_Config();

	  /* Enable the CPU Cache */
	 CPU_CACHE_Enable();

	  /* STM32H7xx HAL library initialization:
		   - Systick timer is configured by default as source of time base, but user
			 can eventually implement his proper time base source (a general purpose
			 timer for example or other time source), keeping in mind that Time base
			 duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and
			 handled in milliseconds basis.
		   - Set NVIC Group Priority to 4
		   - Low Level Initialization
		 */
	  HAL_Init();


	  /* Configure the system clock to 400 MHz */
	  SystemClock_Config();
	  //int ret = SetSysClock_PLL_HSI_480();
	  //assert(ret == 1);

	  /* SDRAM device configuration */
	  BSP_SDRAM_Init(0);

	  for (uint8_t* p = &_sextram; p != &_eextram; ++p)
	  	*p = 0;
}

int main(void)
{


	// Disable unaligned access faults
  //SCB->CCR = SCB->CCR & ~(1<<3);//Resetting the 3rd bit (meant for enabling hardfault for unaligned access)




